---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
source: html/f0db67d1-7fe9-6ada-8e0a-f51614751edd.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData

Represents the data and parameters of point load node.

## Syntax (C#)
```csharp
public class AnalyticalEquipmentLoadData : AnalyticalDistributionNodePropertyData
```